{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_2", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_3"}, "name": "input_3", "inbound_nodes": []}, {"class_name": "Sequential", "config": {"name": "sequential_54", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d_29", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_27", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}]}, "name": "sequential_54", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_55", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d_30", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_47", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_28", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}]}, "name": "sequential_55", "inbound_nodes": [[["sequential_54", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_56", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d_31", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_48", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_29", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}]}, "name": "sequential_56", "inbound_nodes": [[["sequential_55", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_57", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d_32", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_49", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_30", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}]}, "name": "sequential_57", "inbound_nodes": [[["sequential_56", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_58", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d_33", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_50", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_31", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}]}, "name": "sequential_58", "inbound_nodes": [[["sequential_57", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_59", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d_34", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_51", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_32", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}]}, "name": "sequential_59", "inbound_nodes": [[["sequential_58", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_60", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d_35", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_52", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_33", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}]}, "name": "sequential_60", "inbound_nodes": [[["sequential_59", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_61", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d_36", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_53", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_34", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}]}, "name": "sequential_61", "inbound_nodes": [[["sequential_60", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_62", "layers": [{"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_25", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_54", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_14", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_23", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_62", "inbound_nodes": [[["sequential_61", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_2", "inbound_nodes": [[["sequential_62", 0, 0, {}], ["sequential_60", 0, 0, {}]], [["sequential_63", 0, 0, {}], ["sequential_59", 0, 0, {}]], [["sequential_64", 0, 0, {}], ["sequential_58", 0, 0, {}]], [["sequential_65", 0, 0, {}], ["sequential_57", 0, 0, {}]], [["sequential_66", 0, 0, {}], ["sequential_56", 0, 0, {}]], [["sequential_67", 0, 0, {}], ["sequential_55", 0, 0, {}]], [["sequential_68", 0, 0, {}], ["sequential_54", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_63", "layers": [{"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_26", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_55", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_15", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_24", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_63", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_64", "layers": [{"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_27", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_56", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_16", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_25", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_64", "inbound_nodes": [[["concatenate_2", 1, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_65", "layers": [{"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_28", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_57", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_17", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_26", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_65", "inbound_nodes": [[["concatenate_2", 2, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_66", "layers": [{"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_29", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_58", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_18", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_27", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_66", "inbound_nodes": [[["concatenate_2", 3, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_67", "layers": [{"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_30", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_59", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_19", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_28", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_67", "inbound_nodes": [[["concatenate_2", 4, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_68", "layers": [{"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_31", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_60", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_20", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "ReLU", "config": {"name": "re_lu_29", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}}]}, "name": "sequential_68", "inbound_nodes": [[["concatenate_2", 5, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_32", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_32", "inbound_nodes": [[["concatenate_2", 6, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "output_layers": [["conv2d_transpose_32", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of52.bin", "group1-shard2of52.bin", "group1-shard3of52.bin", "group1-shard4of52.bin", "group1-shard5of52.bin", "group1-shard6of52.bin", "group1-shard7of52.bin", "group1-shard8of52.bin", "group1-shard9of52.bin", "group1-shard10of52.bin", "group1-shard11of52.bin", "group1-shard12of52.bin", "group1-shard13of52.bin", "group1-shard14of52.bin", "group1-shard15of52.bin", "group1-shard16of52.bin", "group1-shard17of52.bin", "group1-shard18of52.bin", "group1-shard19of52.bin", "group1-shard20of52.bin", "group1-shard21of52.bin", "group1-shard22of52.bin", "group1-shard23of52.bin", "group1-shard24of52.bin", "group1-shard25of52.bin", "group1-shard26of52.bin", "group1-shard27of52.bin", "group1-shard28of52.bin", "group1-shard29of52.bin", "group1-shard30of52.bin", "group1-shard31of52.bin", "group1-shard32of52.bin", "group1-shard33of52.bin", "group1-shard34of52.bin", "group1-shard35of52.bin", "group1-shard36of52.bin", "group1-shard37of52.bin", "group1-shard38of52.bin", "group1-shard39of52.bin", "group1-shard40of52.bin", "group1-shard41of52.bin", "group1-shard42of52.bin", "group1-shard43of52.bin", "group1-shard44of52.bin", "group1-shard45of52.bin", "group1-shard46of52.bin", "group1-shard47of52.bin", "group1-shard48of52.bin", "group1-shard49of52.bin", "group1-shard50of52.bin", "group1-shard51of52.bin", "group1-shard52of52.bin"], "weights": [{"name": "conv2d_transpose_32/kernel", "shape": [4, 4, 3, 128], "dtype": "float32"}, {"name": "conv2d_transpose_32/bias", "shape": [3], "dtype": "float32"}, {"name": "sequential_54/conv2d_29/kernel", "shape": [4, 4, 3, 64], "dtype": "float32"}, {"name": "sequential_55/conv2d_30/kernel", "shape": [4, 4, 64, 128], "dtype": "float32"}, {"name": "sequential_55/batch_normalization_47/gamma", "shape": [128], "dtype": "float32"}, {"name": "sequential_55/batch_normalization_47/beta", "shape": [128], "dtype": "float32"}, {"name": "sequential_55/batch_normalization_47/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "sequential_55/batch_normalization_47/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "sequential_56/conv2d_31/kernel", "shape": [4, 4, 128, 256], "dtype": "float32"}, {"name": "sequential_56/batch_normalization_48/gamma", "shape": [256], "dtype": "float32"}, {"name": "sequential_56/batch_normalization_48/beta", "shape": [256], "dtype": "float32"}, {"name": "sequential_56/batch_normalization_48/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "sequential_56/batch_normalization_48/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "sequential_57/conv2d_32/kernel", "shape": [4, 4, 256, 512], "dtype": "float32"}, {"name": "sequential_57/batch_normalization_49/gamma", "shape": [512], "dtype": "float32"}, {"name": "sequential_57/batch_normalization_49/beta", "shape": [512], "dtype": "float32"}, {"name": "sequential_57/batch_normalization_49/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "sequential_57/batch_normalization_49/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "sequential_58/conv2d_33/kernel", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "sequential_58/batch_normalization_50/gamma", "shape": [512], "dtype": "float32"}, {"name": "sequential_58/batch_normalization_50/beta", "shape": [512], "dtype": "float32"}, {"name": "sequential_58/batch_normalization_50/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "sequential_58/batch_normalization_50/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "sequential_59/conv2d_34/kernel", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "sequential_59/batch_normalization_51/gamma", "shape": [512], "dtype": "float32"}, {"name": "sequential_59/batch_normalization_51/beta", "shape": [512], "dtype": "float32"}, {"name": "sequential_59/batch_normalization_51/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "sequential_59/batch_normalization_51/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "sequential_60/conv2d_35/kernel", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "sequential_60/batch_normalization_52/gamma", "shape": [512], "dtype": "float32"}, {"name": "sequential_60/batch_normalization_52/beta", "shape": [512], "dtype": "float32"}, {"name": "sequential_60/batch_normalization_52/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "sequential_60/batch_normalization_52/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "sequential_61/conv2d_36/kernel", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "sequential_61/batch_normalization_53/gamma", "shape": [512], "dtype": "float32"}, {"name": "sequential_61/batch_normalization_53/beta", "shape": [512], "dtype": "float32"}, {"name": "sequential_61/batch_normalization_53/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "sequential_61/batch_normalization_53/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "sequential_62/conv2d_transpose_25/kernel", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "sequential_62/batch_normalization_54/gamma", "shape": [512], "dtype": "float32"}, {"name": "sequential_62/batch_normalization_54/beta", "shape": [512], "dtype": "float32"}, {"name": "sequential_62/batch_normalization_54/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "sequential_62/batch_normalization_54/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "sequential_63/conv2d_transpose_26/kernel", "shape": [4, 4, 512, 1024], "dtype": "float32"}, {"name": "sequential_63/batch_normalization_55/gamma", "shape": [512], "dtype": "float32"}, {"name": "sequential_63/batch_normalization_55/beta", "shape": [512], "dtype": "float32"}, {"name": "sequential_63/batch_normalization_55/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "sequential_63/batch_normalization_55/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "sequential_64/conv2d_transpose_27/kernel", "shape": [4, 4, 512, 1024], "dtype": "float32"}, {"name": "sequential_64/batch_normalization_56/gamma", "shape": [512], "dtype": "float32"}, {"name": "sequential_64/batch_normalization_56/beta", "shape": [512], "dtype": "float32"}, {"name": "sequential_64/batch_normalization_56/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "sequential_64/batch_normalization_56/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "sequential_65/conv2d_transpose_28/kernel", "shape": [4, 4, 512, 1024], "dtype": "float32"}, {"name": "sequential_65/batch_normalization_57/gamma", "shape": [512], "dtype": "float32"}, {"name": "sequential_65/batch_normalization_57/beta", "shape": [512], "dtype": "float32"}, {"name": "sequential_65/batch_normalization_57/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "sequential_65/batch_normalization_57/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "sequential_66/conv2d_transpose_29/kernel", "shape": [4, 4, 256, 1024], "dtype": "float32"}, {"name": "sequential_66/batch_normalization_58/gamma", "shape": [256], "dtype": "float32"}, {"name": "sequential_66/batch_normalization_58/beta", "shape": [256], "dtype": "float32"}, {"name": "sequential_66/batch_normalization_58/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "sequential_66/batch_normalization_58/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "sequential_67/conv2d_transpose_30/kernel", "shape": [4, 4, 128, 512], "dtype": "float32"}, {"name": "sequential_67/batch_normalization_59/gamma", "shape": [128], "dtype": "float32"}, {"name": "sequential_67/batch_normalization_59/beta", "shape": [128], "dtype": "float32"}, {"name": "sequential_67/batch_normalization_59/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "sequential_67/batch_normalization_59/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "sequential_68/conv2d_transpose_31/kernel", "shape": [4, 4, 64, 256], "dtype": "float32"}, {"name": "sequential_68/batch_normalization_60/gamma", "shape": [64], "dtype": "float32"}, {"name": "sequential_68/batch_normalization_60/beta", "shape": [64], "dtype": "float32"}, {"name": "sequential_68/batch_normalization_60/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "sequential_68/batch_normalization_60/moving_variance", "shape": [64], "dtype": "float32"}]}]}