{"format": "graph-model", "generatedBy": "2.1.0-rc1", "convertedBy": "TensorFlow.js Converter v1.4.0", "userDefinedMetadata": {"signature": {"inputs": {"input_3:0": {"name": "input_3:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}}}}, "modelTopology": {"node": [{"name": "input_3", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_55/conv2d_30/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_55/conv2d_30/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_56/conv2d_31/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_56/conv2d_31/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_57/conv2d_32/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_57/conv2d_32/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_58/conv2d_33/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_58/conv2d_33/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_59/conv2d_34/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_59/conv2d_34/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_60/conv2d_35/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_60/conv2d_35/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_61/conv2d_36/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_61/conv2d_36/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_54/conv2d_29/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "3"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack_1", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice_1/stack_1", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/mul/y", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice_2/stack_1", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/stack/3", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/conv2d_transpose/ReadVariableOp", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/concatenate_2/concat/axis", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_63/conv2d_transpose_26/conv2d_transpose/ReadVariableOp", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_32/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_64/conv2d_transpose_27/conv2d_transpose/ReadVariableOp", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_65/conv2d_transpose_28/conv2d_transpose/ReadVariableOp", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_66/conv2d_transpose_29/stack/3", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_66/conv2d_transpose_29/conv2d_transpose/ReadVariableOp", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_67/conv2d_transpose_30/stack/3", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_67/conv2d_transpose_30/conv2d_transpose/ReadVariableOp", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_68/conv2d_transpose_31/stack/3", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_68/conv2d_transpose_31/conv2d_transpose/ReadVariableOp", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/conv2d_transpose_32/conv2d_transpose/ReadVariableOp", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "3"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_62/batch_normalization_54/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_62/batch_normalization_54/FusedBatchNormV3/Offset", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_68/batch_normalization_60/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_68/batch_normalization_60/FusedBatchNormV3/Offset", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_67/batch_normalization_59/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_67/batch_normalization_59/FusedBatchNormV3/Offset", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_66/batch_normalization_58/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_66/batch_normalization_58/FusedBatchNormV3/Offset", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_65/batch_normalization_57/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_65/batch_normalization_57/FusedBatchNormV3/Offset", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_64/batch_normalization_56/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_64/batch_normalization_56/FusedBatchNormV3/Offset", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_63/batch_normalization_55/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_63/batch_normalization_55/FusedBatchNormV3/Offset", "op": "Const", "input": ["^input_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_54/conv2d_29/Conv2D", "op": "Conv2D", "input": ["input_3", "StatefulPartitionedCall/model_2/sequential_54/conv2d_29/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model_2/sequential_54/leaky_re_lu_27/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model_2/sequential_54/conv2d_29/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/model_2/sequential_55/batch_normalization_47/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_2/sequential_54/leaky_re_lu_27/LeakyRelu", "StatefulPartitionedCall/model_2/sequential_55/conv2d_30/Conv2D_weights", "StatefulPartitionedCall/model_2/sequential_55/conv2d_30/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_55/leaky_re_lu_28/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model_2/sequential_55/batch_normalization_47/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/model_2/sequential_56/batch_normalization_48/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_2/sequential_55/leaky_re_lu_28/LeakyRelu", "StatefulPartitionedCall/model_2/sequential_56/conv2d_31/Conv2D_weights", "StatefulPartitionedCall/model_2/sequential_56/conv2d_31/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_56/leaky_re_lu_29/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model_2/sequential_56/batch_normalization_48/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/model_2/sequential_57/batch_normalization_49/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_2/sequential_56/leaky_re_lu_29/LeakyRelu", "StatefulPartitionedCall/model_2/sequential_57/conv2d_32/Conv2D_weights", "StatefulPartitionedCall/model_2/sequential_57/conv2d_32/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_57/leaky_re_lu_30/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model_2/sequential_57/batch_normalization_49/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/model_2/sequential_58/batch_normalization_50/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_2/sequential_57/leaky_re_lu_30/LeakyRelu", "StatefulPartitionedCall/model_2/sequential_58/conv2d_33/Conv2D_weights", "StatefulPartitionedCall/model_2/sequential_58/conv2d_33/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_58/leaky_re_lu_31/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model_2/sequential_58/batch_normalization_50/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/model_2/sequential_59/batch_normalization_51/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_2/sequential_58/leaky_re_lu_31/LeakyRelu", "StatefulPartitionedCall/model_2/sequential_59/conv2d_34/Conv2D_weights", "StatefulPartitionedCall/model_2/sequential_59/conv2d_34/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_59/leaky_re_lu_32/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model_2/sequential_59/batch_normalization_51/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/model_2/sequential_60/batch_normalization_52/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_2/sequential_59/leaky_re_lu_32/LeakyRelu", "StatefulPartitionedCall/model_2/sequential_60/conv2d_35/Conv2D_weights", "StatefulPartitionedCall/model_2/sequential_60/conv2d_35/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_60/leaky_re_lu_33/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model_2/sequential_60/batch_normalization_52/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/model_2/sequential_61/batch_normalization_53/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_2/sequential_60/leaky_re_lu_33/LeakyRelu", "StatefulPartitionedCall/model_2/sequential_61/conv2d_36/Conv2D_weights", "StatefulPartitionedCall/model_2/sequential_61/conv2d_36/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model_2/sequential_61/leaky_re_lu_34/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model_2/sequential_61/batch_normalization_53/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.30000001192092896}}}, {"name": "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_2/sequential_61/leaky_re_lu_34/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/Shape", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack_1", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/Shape", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack_1", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice_1/stack_1", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/Shape", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice_1/stack_1", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice_2/stack_1", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/mul/y", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/mul/y", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice_2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/mul", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/mul_1", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/stack", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_2/sequential_61/leaky_re_lu_34/LeakyRelu"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model_2/sequential_62/batch_normalization_54/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/sequential_62/batch_normalization_54/FusedBatchNormV3/Scaled", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/conv2d_transpose"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_62/batch_normalization_54/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model_2/sequential_62/batch_normalization_54/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_2/sequential_62/batch_normalization_54/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_62/re_lu_23/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_2/sequential_62/batch_normalization_54/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/concatenate_2/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_2/sequential_62/re_lu_23/Relu", "StatefulPartitionedCall/model_2/sequential_60/leaky_re_lu_33/LeakyRelu", "StatefulPartitionedCall/model_2/concatenate_2/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_63/conv2d_transpose_26/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_2/concatenate_2/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_63/conv2d_transpose_26/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_2/sequential_63/conv2d_transpose_26/Shape", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack_1", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_63/conv2d_transpose_26/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_2/sequential_63/conv2d_transpose_26/Shape", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack_1", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice_1/stack_1", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_63/conv2d_transpose_26/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_2/sequential_63/conv2d_transpose_26/Shape", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice_1/stack_1", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice_2/stack_1", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_63/conv2d_transpose_26/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/mul/y", "StatefulPartitionedCall/model_2/sequential_63/conv2d_transpose_26/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_63/conv2d_transpose_26/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/mul/y", "StatefulPartitionedCall/model_2/sequential_63/conv2d_transpose_26/strided_slice_2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_63/conv2d_transpose_26/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_2/sequential_63/conv2d_transpose_26/strided_slice", "StatefulPartitionedCall/model_2/sequential_63/conv2d_transpose_26/mul", "StatefulPartitionedCall/model_2/sequential_63/conv2d_transpose_26/mul_1", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_63/conv2d_transpose_26/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_2/sequential_63/conv2d_transpose_26/stack", "StatefulPartitionedCall/model_2/sequential_63/conv2d_transpose_26/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_2/concatenate_2/concat"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model_2/sequential_63/batch_normalization_55/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/sequential_63/batch_normalization_55/FusedBatchNormV3/Scaled", "StatefulPartitionedCall/model_2/sequential_63/conv2d_transpose_26/conv2d_transpose"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_63/batch_normalization_55/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model_2/sequential_63/batch_normalization_55/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_2/sequential_63/batch_normalization_55/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_63/re_lu_24/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_2/sequential_63/batch_normalization_55/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/concatenate_2_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_2/sequential_63/re_lu_24/Relu", "StatefulPartitionedCall/model_2/sequential_59/leaky_re_lu_32/LeakyRelu", "StatefulPartitionedCall/model_2/concatenate_2/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_64/conv2d_transpose_27/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_2/concatenate_2_1/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_64/conv2d_transpose_27/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_2/sequential_64/conv2d_transpose_27/Shape", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack_1", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_64/conv2d_transpose_27/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_2/sequential_64/conv2d_transpose_27/Shape", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack_1", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice_1/stack_1", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_64/conv2d_transpose_27/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_2/sequential_64/conv2d_transpose_27/Shape", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice_1/stack_1", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice_2/stack_1", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_64/conv2d_transpose_27/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/mul/y", "StatefulPartitionedCall/model_2/sequential_64/conv2d_transpose_27/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_64/conv2d_transpose_27/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/mul/y", "StatefulPartitionedCall/model_2/sequential_64/conv2d_transpose_27/strided_slice_2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_64/conv2d_transpose_27/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_2/sequential_64/conv2d_transpose_27/strided_slice", "StatefulPartitionedCall/model_2/sequential_64/conv2d_transpose_27/mul", "StatefulPartitionedCall/model_2/sequential_64/conv2d_transpose_27/mul_1", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_64/conv2d_transpose_27/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_2/sequential_64/conv2d_transpose_27/stack", "StatefulPartitionedCall/model_2/sequential_64/conv2d_transpose_27/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_2/concatenate_2_1/concat"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model_2/sequential_64/batch_normalization_56/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/sequential_64/batch_normalization_56/FusedBatchNormV3/Scaled", "StatefulPartitionedCall/model_2/sequential_64/conv2d_transpose_27/conv2d_transpose"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_64/batch_normalization_56/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model_2/sequential_64/batch_normalization_56/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_2/sequential_64/batch_normalization_56/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_64/re_lu_25/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_2/sequential_64/batch_normalization_56/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/concatenate_2_2/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_2/sequential_64/re_lu_25/Relu", "StatefulPartitionedCall/model_2/sequential_58/leaky_re_lu_31/LeakyRelu", "StatefulPartitionedCall/model_2/concatenate_2/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_65/conv2d_transpose_28/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_2/concatenate_2_2/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_65/conv2d_transpose_28/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_2/sequential_65/conv2d_transpose_28/Shape", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack_1", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_65/conv2d_transpose_28/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_2/sequential_65/conv2d_transpose_28/Shape", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack_1", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice_1/stack_1", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_65/conv2d_transpose_28/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_2/sequential_65/conv2d_transpose_28/Shape", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice_1/stack_1", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice_2/stack_1", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_65/conv2d_transpose_28/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/mul/y", "StatefulPartitionedCall/model_2/sequential_65/conv2d_transpose_28/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_65/conv2d_transpose_28/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/mul/y", "StatefulPartitionedCall/model_2/sequential_65/conv2d_transpose_28/strided_slice_2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_65/conv2d_transpose_28/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_2/sequential_65/conv2d_transpose_28/strided_slice", "StatefulPartitionedCall/model_2/sequential_65/conv2d_transpose_28/mul", "StatefulPartitionedCall/model_2/sequential_65/conv2d_transpose_28/mul_1", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_65/conv2d_transpose_28/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_2/sequential_65/conv2d_transpose_28/stack", "StatefulPartitionedCall/model_2/sequential_65/conv2d_transpose_28/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_2/concatenate_2_2/concat"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model_2/sequential_65/batch_normalization_57/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/sequential_65/batch_normalization_57/FusedBatchNormV3/Scaled", "StatefulPartitionedCall/model_2/sequential_65/conv2d_transpose_28/conv2d_transpose"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_65/batch_normalization_57/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model_2/sequential_65/batch_normalization_57/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_2/sequential_65/batch_normalization_57/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_65/re_lu_26/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_2/sequential_65/batch_normalization_57/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/concatenate_2_3/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_2/sequential_65/re_lu_26/Relu", "StatefulPartitionedCall/model_2/sequential_57/leaky_re_lu_30/LeakyRelu", "StatefulPartitionedCall/model_2/concatenate_2/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_66/conv2d_transpose_29/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_2/concatenate_2_3/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_66/conv2d_transpose_29/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_2/sequential_66/conv2d_transpose_29/Shape", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack_1", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_66/conv2d_transpose_29/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_2/sequential_66/conv2d_transpose_29/Shape", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack_1", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice_1/stack_1", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_66/conv2d_transpose_29/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_2/sequential_66/conv2d_transpose_29/Shape", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice_1/stack_1", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice_2/stack_1", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_66/conv2d_transpose_29/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/mul/y", "StatefulPartitionedCall/model_2/sequential_66/conv2d_transpose_29/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_66/conv2d_transpose_29/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/mul/y", "StatefulPartitionedCall/model_2/sequential_66/conv2d_transpose_29/strided_slice_2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_66/conv2d_transpose_29/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_2/sequential_66/conv2d_transpose_29/strided_slice", "StatefulPartitionedCall/model_2/sequential_66/conv2d_transpose_29/mul", "StatefulPartitionedCall/model_2/sequential_66/conv2d_transpose_29/mul_1", "StatefulPartitionedCall/model_2/sequential_66/conv2d_transpose_29/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_66/conv2d_transpose_29/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/model_2/sequential_66/conv2d_transpose_29/stack", "StatefulPartitionedCall/model_2/sequential_66/conv2d_transpose_29/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/model_2/concatenate_2_3/concat"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model_2/sequential_66/batch_normalization_58/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_2/sequential_66/batch_normalization_58/FusedBatchNormV3/Scaled", "StatefulPartitionedCall/model_2/sequential_66/conv2d_transpose_29/conv2d_transpose"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_66/batch_normalization_58/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model_2/sequential_66/batch_normalization_58/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_2/sequential_66/batch_normalization_58/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_66/re_lu_27/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_2/sequential_66/batch_normalization_58/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_2/concatenate_2_4/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_2/sequential_66/re_lu_27/Relu", "StatefulPartitionedCall/model_2/sequential_56/leaky_re_lu_29/LeakyRelu", "StatefulPartitionedCall/model_2/concatenate_2/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_67/conv2d_transpose_30/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_2/concatenate_2_4/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_67/conv2d_transpose_30/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_2/sequential_67/conv2d_transpose_30/Shape", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack_1", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_67/conv2d_transpose_30/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_2/sequential_67/conv2d_transpose_30/Shape", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack_1", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice_1/stack_1", "StatefulPartitionedCall/model_2/sequential_62/conv2d_transpose_25/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_2/sequential_67/conv2d_transpose_30/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_2/sequential_67/conv2d_transpose_30/Shape", 